# -*- coding=utf-8 -*-


"""
    服务器定义
"""

# 服务器id的和名字的映射
SERVER_NAME_MAP = {
    10001:u'内部测试服务器',
    10003:u'宝石海星',
    10004:u'飞天螳螂',
    10005:u'小火龙',
    10006:u'火恐龙',
    30001:u'渠道测试服务器',
}

SERVER_NAME_LST = [
    {'id': 10001, 'name': u'内部测试服务器'},
    {'id': 10003, 'name': u'宝石海星'},
    {'id': 10004, 'name': u'飞天螳螂'},
    {'id': 10005, 'name': u'小火龙'},
    {'id': 10006, 'name': u'火恐龙'},
    {'id': 30001, 'name': u'渠道测试服务器'}
]

# CMEM持久层映射
CMEM_MAP = {
    10001: '10.66.145.119:9101',
    10003: '10.66.147.252:9101',
    10004: '10.66.147.251:9101',
    10005: '10.66.110.54:9101',
    10006: '10.66.132.110:9101',
    30001: '10.66.140.117:9101',
    20003 : '',
}